---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.CheckCircuits
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.CheckCircuits

Verifies all circuits for proper connections to panels and valid system assignments. Errors are reported in a warning dialog.